#13. y(x) = cos(x) + x

clear all;
x = [0 0.2*pi 0.4*pi 0.6*pi 0.8*pi pi]';
y = cos(x) + x;
dx = 0.2*pi;

#формула 0-го порядка
#y1 * dx
y(1) * dx 

#формула 1-го порядка 
#(y1+y2)/2 * dx
(y(1)+y(2))/2 * dx

#формула 2-го порядка
#dx/3 * (y3 + 4y2 + y1)
dx/3 * (y(3) + 4*y(2) + y(1))

#формула 3-го порядка
#3*dx/8 * (y4 + 3y3 + 3*y2 + y1)
3*dx/8 * (y(4) + 3*y(3) + 3*y(2) + y(1)) 

#формула 4-го порядка
#2*dx/45 * (7*y1 + 32*y2 + 12*y3 + 32*y4 + 7*y5)
2*dx/45 * (7*y(1) + 32*y(2) + 12*y(3) + 32*y(4) + 7*y(5))