#13. y(x) = cos(x) + x

clear all;
x = [0 0.2*pi 0.4*pi 0.6*pi 0.8*pi pi];
y = cos(x) + x;
dx = 0.2*pi;

#формула 0-го порядка (прямоугольников)
#dx * (y1 + y2 + ... + y5)
dx * (y(1) + y(2) + y(3) + y(4) + y(5))

#формула 1-го порядка (трапеций)
#(y1/2 + y2 +y3 + y4 + y5/2)
dx * (y(1)/2 + y(2) + y(3) + y(4) + y(5)/2)

#формула 2-го порядка (Симпсона)
#dx/3 * (y1 + 4*y2 + 2*y3 + 4*y4 + 2*y5 + y6)
dx/3 * (y(1) + 4*y(2) + 2*y(3) + 4*y(4) + y(5))  

#формула 3-го порядка
#3*dx/8 * (y1 + 3*y2 + 3*y3 + 2*y4 + y5)
3*dx/8 * (y(1) + 3*y(2) + 3*y(3) + 2*y(4) + y(5))

#формула 4-го порядка
#2*dx/45 * (7*y1 + 32*y2 + 12*y3 + 32*y4 + 7*y5)
2*dx/45 * (7*y(1) + 32*y(2) + 12*y(3) + 32*y(4) + 7*y(5))